[
    {
        "scene": -2,
        "sentences": [
            {
                "id": "1",
                "sentence": "Place un cube sur le cube précédent.",
                "code": "ambig"
            },
            {
                "id": "2",
                "sentence": "Place une brique jaune orientée Nord-Sud sur le cube précédent.",
                "code": "false"
            },
            {
                "id": "3",
                "sentence": "Place le cube bleu sur le cube précédent.",
                "code": "ok"
            },
            {
                "id": "4",
                "sentence": "Place un autre cube sur le cube précédent.",
                "code": "ambig"
            },
            {
                "id": "5",
                "sentence": "Place un cube bleu sur le cube jaune.",
                "code": "ok"
            }
        ]
    },
    {
        "scene": -1,
        "sentences": [
            {
                "id": "1",
                "sentence": "Place une barre bleue au Nord du cube jaune.",
                "code": "false"
            },
            {
                "id": "2",
                "sentence": "Place un cube jaune sur le cube précédent.",
                "code": "false"
            },
            {
                "id": "3",
                "sentence": "Places-en un autre à l'Ouest du cube précédent.",
                "code": "ambig"
            },
            {
                "id": "4",
                "sentence": "Place un cube à l'Ouest du cube précédent.",
                "code": "ambig"
            },
            {
                "id": "5",
                "sentence": "Place un cube bleu à l'Ouest du cube précédent.",
                "code": "ok"
            }
        ]
    },
    {
        "scene": 0,
        "sentences": [
            {
                "id": "1",
                "sentence": "Place une barre bleue perpendiculairement 9 tenons à l'Ouest de l'escalier jaune. La barre bleue doit être centrée par rapport à l'axe Est-Ouest de l'escalier.",
                "code": "ok"
            },
            {
                "id": "2",
                "sentence": "Aligne sur l'axe Est-Ouest une barre bleue Nord-Sud 9 tenons à l'Ouest de la base de l'escalier jaune.",
                "code": "ok"
            },
            {
                "id": "3",
                "sentence": "Colle une barre bleue orientée Nord-Sud à l'Ouest de l'escalier jaune, avec son côté Nord aligné sur le côté Nord de l'escalier jaune. Puis décale la barre bleue de 9 tenons vers l'Ouest, et de 2 vers le Nord.",
                "code": "ok"
            },
            {
                "id": "4",
                "sentence": "Place une barre bleue orientée Nord-Sud à l'Ouest de l'escalier, en laissant 9 tenons libres et en les centrant sur l'axe Est-Ouest.",
                "code": "false"
            }
        ]
    },
    {
        "scene": 1,
        "sentences": [
            {
                "id": "1",
                "sentence": "Place une barre rouge orientée Nord-Sud, au coin Sud-Ouest de la barre jaune. Les deux barres ne se touchent que par un coin."
            },
            {
                "id": "2",
                "sentence": "Place une barre rouge orientée Nord-Sud, au coin Sud-Ouest de la barre jaune."
            },
            {
                "id": "3",
                "sentence": "Place une barre rouge orientée Nord-Sud pour que son coin Nord-Est touche le coin Sud-Ouest de la barre précédente."
            },
            {
                "id": "4",
                "sentence": "Place une barre rouge orientée Nord-Sud, son coin Nord-Est touchant le coin Sud-Ouest de la barre jaune."
            }
        ]
    },
    {
        "scene": 2,
        "sentences": [
            {
                "id": "1",
                "sentence": "Place une barre rouge orientée Est-Ouest au coin Sud-Ouest de la barre jaune. Les deux barres ne se touchent que par un coin."
            },
            {
                "id": "2",
                "sentence": "Place une barre rouge orientée Est-Ouest au coin Sud-Ouest de la barre jaune."
            },
            {
                "id": "3",
                "sentence": "Au contact du coin Sud-Ouest de la barre jaune, viens placer le coin Nord-Est d'une barre rouge orientée Est-Ouest."
            },
            {
                "id": "4",
                "sentence": "Place une barre rouge orientée Est-Ouest pour que son coin Nord-Est touche le coin Sud-Ouest de la barre jaune."
            }
        ]
    },
    {
        "scene": 3,
        "sentences": [
            {
                "id": "1",
                "sentence": "Colle une barre rouge orientée Est-Ouest au Sud de la barre jaune, puis décale la barre rouge de 3 tenons vers l'Ouest. Le côté Sud de la barre jaune touche la barre rouge sur 3 tenons."
            },
            {
                "id": "2",
                "sentence": "Aligne sur l'axe Nord-Sud une barre rouge Est-Ouest au contact de la face Sud de la barre jaune, puis décale-la de 3 tenons vers l'Ouest."
            },
            {
                "id": "3",
                "sentence": "Place une barre rouge orientée Est-Ouest au Sud de la barre jaune. Puis décale la barre rouge de 3 tenons vers l'Ouest."
            },
            {
                "id": "4",
                "sentence": "Place une barre rouge au contact de la barre jaune, au Sud, mais décalée de 3 tenons vers l'Ouest."
            },
            {
                "id": "5",
                "sentence": "Place une barre rouge le long de la face Sud de la barre jaune, décalée de trois positions vers l'Ouest."
            }
        ]
    },
    {
        "scene": 4,
        "sentences": [
            {
                "id": "1",
                "sentence": "Colle une barre rouge orientée Est-Ouest au Sud de la barre jaune, puis décale la barre rouge de 2 tenons vers le Sud. Les bords Est et Ouest des deux barres doivent être alignés."
            },
            {
                "id": "2",
                "sentence": "Aligne sur l'axe Nord-Sud une barre rouge Est-Ouest 2 tenons au Sud de la barre jaune."
            },
            {
                "id": "3",
                "sentence": "Place une barre rouge orientée Est-Ouest au Sud de la barre précédente, en décalant la barre rouge de 2 tenons libres vers le Sud."
            },
            {
                "id": "4",
                "sentence": "Aligne une barre rouge au Sud de la barre jaune, en laissant 2 tenons libres."
            },
            {
                "id": "5",
                "sentence": "Place une barre rouge alignée Est-Ouest au contact du bord Sud de la barre jaune. Les deux barres sont centrées sur l'axe Nord-Sud. Puis déplace la barre rouge de deux tenons vers le Sud."
            }
        ]
    },
    {
        "scene": 5,
        "sentences": [
            {
                "id": "1",
                "sentence": "Place une barre rouge 4 tenons au Sud de la barre jaune puis décale la barre d'un tenon vers l'Est. La barre jaune et la barre rouge ne se touchent pas et ne sont pas alignées."
            },
            {
                "id": "2",
                "sentence": "Aligne sur l'axe Nord-Sud une barre rouge Est-Ouest 4 tenons au Sud de la barre jaune, puis décale-la d'un tenon vers l'Est."
            },
            {
                "id": "3",
                "sentence": "Place une barre rouge orientée Est-Ouest collée au Sud de la barre précédente. Puis décale-la de 4 tenons vers le Sud et d’1 tenon vers l'Est."
            },
            {
                "id": "4",
                "sentence": "Aligne une barre rouge au Sud de la barre jaune, en laissant 4 tenons libres. Puis décale-la d'1 tenon vers l'Est."
            },
            {
                "id": "5",
                "sentence": "Colle une barre rouge orientée Est-Ouest au Sud de la barre jaune. Les deux barres sont centrées sur l'axe Nord-Sud. Puis déplace la barre rouge 4 tenons vers le Sud et d’1 tenon vers l'Est."
            }
        ]
    },
    {
        "scene": 6,
        "sentences": [
            {
                "id": "1",
                "sentence": "Place une barre bleue à cheval sur la tour rouge et l'escalier jaune de façon à former une arche. La barre bleue ne doit pas dépasser des structures qu'elle chevauche."
            },
            {
                "id": "2",
                "sentence": "Place une barre bleue en recouvrant la tour rouge et l'escalier jaune. La barre bleue ne doit dépasser d’aucun côté."
            },
            {
                "id": "3",
                "sentence": "Place une barre bleue orientée Est-Ouest sur le cube rouge. Les coins Nord-Ouest sont alignés. La barre bleue doit également être sur le cube jaune."
            },
            {
                "id": "4",
                "sentence": "Dépose une barre bleue orientée Est-Ouest sur le pilier et le haut de l'escalier, pour les recouvrir complétement."
            },
            {
                "id": "5",
                "sentence": "Place une barre bleue pour faire un pont reposant sur les cubes rouges et jaunes, en alignant le coin Nord-Ouest de la barre avec celui du dernier cube posé."
            },
            {
                "id": "6",
                "sentence": "Place une barre bleue recouvrant entièrement le dernier cube posé et le sommet jaune de l'escalier."
            }
        ]
    },
    {
        "scene": 7,
        "sentences": [
            {
                "id": "1",
                "sentence": "Place une barre bleue à cheval sur les deux tours rouges pour former une arche. La barre bleue doit couvrir tous les tenons des piliers."
            },
            {
                "id": "2",
                "sentence": "Place une barre bleue à cheval sur les deux tours rouges de façon à ce qu'elle ne dépasse pas."
            },
            {
                "id": "3",
                "sentence": "Place une barre bleue orientée Nord-Sud en recouvrant les 2 tours rouges."
            },
            {
                "id": "4",
                "sentence": "Place une barre bleue qui recouvre exactement les 2 tours rouges."
            },
            {
                "id": "5",
                "sentence": "Forme une arche en posant une barre bleue orientée Nord-Sud qui recouvre parfaitement les deux piliers rouges."
            }
        ]
    },
    {
        "scene": 8,
        "sentences": [
            {
                "id": "1",
                "sentence": "Place une barre bleue à cheval sur la tour rouge située dans l'alignement de l'escalier jaune et l'escalier, de façon à former une arche. La barre bleue ne doit pas dépasser les structures qu'elle chevauche."
            },
            {
                "id": "2",
                "sentence": "Place une barre bleue orientée Est-Ouest à cheval sur les sommets de l'escalier jaune et de la tour rouge la plus au Nord, de manière à les recouvrir totalement."
            },
            {
                "id": "3",
                "sentence": "Dépose une barre bleue recouvrant complètement la tour rouge au Nord et le sommet de l'escalier jaune."
            },
            {
                "id": "4",
                "sentence": "Empile une barre bleue orientée Est-Ouest pour recouvrir exactement le haut de l'escalier et le pilier qui est à l'Ouest de ce dernier."
            }
        ]
    },
    {
        "scene": 9,
        "sentences": [
            {
                "id": "1",
                "sentence": "Place un cube bleu 7 tenons à l'Ouest de la barre Est-Ouest de la croix jaune. Le cube et la croix sont alignés selon l'axe Est-Ouest."
            },
            {
                "id": "2",
                "sentence": "Aligne sur l'axe Est-Ouest un cube bleu 7 tenons à l'Ouest de la barre jaune."
            },
            {
                "id": "3",
                "sentence": "Place un cube bleu à l'Ouest de la barre jaune de la croix jaune, en le décalant de 7 tenons libres vers l'Ouest."
            },
            {
                "id": "4",
                "sentence": "Place un cube bleu à l'Ouest du côté le plus à l'Ouest de la croix jaune, en le décalant de 7 tenons libres vers l'Ouest."
            },
            {
                "id": "5",
                "sentence": "Place un cube bleu dans l’axe Est-Ouest de la croix jaune, à 7 tenons libres à l'Ouest de la croix."
            }
        ]
    },
    {
        "scene": 10,
        "sentences": [
            {
                "id": "1",
                "sentence": "Colle un cube bleu au Sud de la croix jaune. Le cube doit être centré sur l'axe Nord-Sud de la croix. Puis décale le cube d’1 tenon vers le Sud et de 12 vers l’Ouest."
            },
            {
                "id": "2",
                "sentence": "Sur l’axe Est-Ouest de la croix, place un cube bleu à l’Ouest en laissant 8 tenons libres puis décale-le de 5 tenons vers le Sud."
            },
            {
                "id": "3",
                "sentence": "Place un cube bleu à l'Ouest du côté le plus à l'Ouest de la croix jaune, en le décalant de 8 tenons libres vers l'Ouest, et de 5 vers le Sud."
            },
            {
                "id": "4",
                "sentence": "Aligne un cube bleu à l'Ouest de la barre de la croix jaune, en laissant 8 tenons libres, avant de le descendre au Sud de 5 tenons."
            },
            {
                "id": "5",
                "sentence": "Colle un cube bleu à la face Sud de la croix, puis décale-le de 1 tenon vers le Sud et 12 tenons vers l'Ouest."
            },
            {
                "id": "6",
                "sentence": "Place un cube bleu adjacent au Sud du dernier cube jaune posé, puis décale-le de 1 tenon au Sud, puis de 12 tenons à l'Ouest."
            }
        ]
    },
    {
        "scene": 11,
        "sentences": [
            {
                "id": "1",
                "sentence": "Place un cube bleu au Sud de la barre jaune et à l'Ouest du cube Sud de la croix jaune. Le cube bleu doit toucher la barre jaune et le cube précédent."
            },
            {
                "id": "2",
                "sentence": "Place un cube bleu au contact du coin Sud-Ouest de la croix jaune. La face Nord du cube doit toucher le Sud de la branche Ouest de la croix et sa face Est l'Ouest de la branche Sud de la croix."
            },
            {
                "id": "3",
                "sentence": "Place un cube bleu directement à l'Ouest du cube précédent et au Sud de la barre jaune. Le cube bleu doit être accolé à ces deux éléments."
            },
            {
                "id": "4",
                "sentence": "Bouche le trou Sud-Ouest de la croix avec un cube bleu."
            },
            {
                "id": "5",
                "sentence": "Place un cube bleu au Sud-Ouest de la croix, afin qu'il touche les deux branches de la croix."
            }
        ]
    },
    {
        "scene": 12,
        "sentences": [
            {
                "id": "1",
                "sentence": "Place un cube bleu au coin Sud-Ouest du cube au Sud de la croix jaune. Le cube et la croix ne se touchent que par un coin."
            },
            {
                "id": "2",
                "sentence": "Colle un cube bleu au Sud du dernier cube posé puis décale-le de 2 tenons libres vers l’Ouest."
            },
            {
                "id": "3",
                "sentence": "Place un cube bleu collé au coin Sud-Ouest du cube précédent."
            },
            {
                "id": "4",
                "sentence": "Colle au coin Sud-Ouest du cube précédent le coin Nord-Est d’un cube bleu."
            },
            {
                "id": "5",
                "sentence": "Place un cube bleu de sorte que son coin Nord-Est touche le coin Sud-Ouest du dernier cube posé."
            }
        ]
    },
    {
        "scene": 13,
        "sentences": [
            {
                "id": "1",
                "sentence": "Place un cube bleu au coin Sud-Ouest de la barre de la croix jaune. Le cube et la croix ne se touchent que par un coin."
            },
            {
                "id": "2",
                "sentence": "Colle un cube bleu à l'Ouest de la croix jaune, dans l'alignement de la barre jaune Est-Ouest, et décale-le de 2 tenons vers le Sud. Le coin Nord-Est du cube doit toucher le coin Sud-Ouest de la barre."
            },
            {
                "id": "3",
                "sentence": "Place un cube bleu, ayant son côté Est aligné sur celui le plus à l'Ouest de la croix jaune et son côté Sud aligné sur celui du cube précédent."
            },
            {
                "id": "4",
                "sentence": "Colle par le coin Nord-Est un cube bleu au coin Sud-Ouest de la barre de la croix jaune."
            },
            {
                "id": "5",
                "sentence": "Colle un cube bleu directement à l'Ouest du cube précédent puis décale-le de 2 tenons vers l'Ouest."
            }
        ]
    },
    {
        "scene": 14,
        "sentences": [
            {
                "id": "1",
                "sentence": "Colle un cube bleu au Sud de la croix jaune. Le cube bleu doit être centré avec l'axe Nord-Sud de la croix. Puis décale le cube bleu de 2 tenons vers le Sud et 2 tenons vers l'Ouest."
            },
            {
                "id": "2",
                "sentence": "Aligne sur l'axe Nord-Sud un cube bleu deux tenons au Sud de la croix jaune, puis décale-le de deux tenons vers l'Ouest. Les faces Ouest du cube et de la branche Ouest de la croix sont alignées."
            },
            {
                "id": "3",
                "sentence": "Place un cube bleu entre les branches Sud et Ouest de la croix, puis décale-le de 4 tenons vers le Sud."
            },
            {
                "id": "4",
                "sentence": "Colle un cube bleu à l'Ouest du cube précédent puis décale-le de 4 tenons vers le Sud."
            },
            {
                "id": "5",
                "sentence": "Place un cube bleu en alignant le bord Ouest sur celui de la croix jaune, puis en descendant au Sud pour laisser 4 tenons libres."
            }
        ]
    },
    {
        "scene": 15,
        "sentences": [
            {
                "id": "1",
                "sentence": "Place un cube bleu au Sud de la croix jaune puis décale le cube de 2 tenons vers le Sud. Le cube doit être centré avec sur l'axe Nord-Sud de la croix."
            },
            {
                "id": "2",
                "sentence": "Dans la direction Sud de la croix, place un cube bleu en laissant 2 tenons libres."
            },
            {
                "id": "3",
                "sentence": "Place un cube bleu 2 tenons libres au Sud du cube précédent."
            },
            {
                "id": "4",
                "sentence": "Place un cube bleu au Sud de la croix jaune, centré sur l’axe Nord-Sud de la croix, en laissant 2 tenons libres."
            }
        ]
    },
    {
        "scene": 16,
        "sentences": [
            {
                "id": "1",
                "sentence": "Place une barre rouge orientée Est-Ouest, 2 tenons au Sud de la croix jaune. La barre rouge doit être centrée avec l'axe Nord-Sud de la croix jaune."
            },
            {
                "id": "2",
                "sentence": "Centre une barre rouge orientée Est-Ouest sur l'axe Nord-Sud de la croix jaune en laissant deux tenons au Sud de la croix."
            },
            {
                "id": "3",
                "sentence": "Place une barre rouge orientée Est-Ouest au Sud de la croix jaune, ayant son côté Ouest aligné sur celui le plus à l'Ouest de la croix jaune et en décalant la barre rouge de 2 tenons libres vers le Sud."
            },
            {
                "id": "4",
                "sentence": "Place une barre rouge au Sud de la croix jaune, alignée sur l'axe Nord-Sud, mais en laissant 2 tenons libres."
            },
            {
                "id": "5",
                "sentence": "Place une barre rouge avec deux tenons libres au Sud du cube précédent, centrée sur l’axe Nord-Sud de la croix."
            }
        ]
    },
    {
        "scene": 17,
        "sentences": [
            {
                "id": "1",
                "sentence": "Colle une barre rouge orientée Est-Ouest au Sud de la croix jaune en alignant leurs axes Nord-Sud, puis décale la barre rouge de 6 tenons vers l'Ouest et de 1 tenon vers le Sud. Le côté Est de la barre rouge doit être aligné avec le côté Ouest de la croix jaune."
            },
            {
                "id": "2",
                "sentence": "Centre une barre rouge orientée Est-Ouest sur l’axe Nord-Sud de la croix à 1 tenon au Sud puis décale-le vers l'Ouest jusqu’à aligner son bord Est avec le bord le plus à l’Ouest de la croix."
            },
            {
                "id": "3",
                "sentence": "Place une barre rouge orientée Est-Ouest au Sud du cube précédent en laissant 1 tenon libre, et en alignant son bord Est avec le bord Ouest de la barre jaune."
            },
            {
                "id": "4",
                "sentence": "Place une barre rouge orientée Est-Ouest en la collant au côté Ouest de la croix jaune, puis en décalant de 5 tenons vers le Sud."
            },
            {
                "id": "5",
                "sentence": "Place une barre rouge orientée Est-Ouest pour que son coin Nord-Est soit en contact avec le coin Sud-Ouest du cube précédent. Puis déplace cette barre d’1 tenon vers le Sud et de 2 vers l'Ouest."
            }
        ]
    },
    {
        "scene": 18,
        "sentences": [
            {
                "id": "1",
                "sentence": "Colle une barre rouge orientée Est-Ouest au Sud de la croix jaune de manière à la centrer sur l'axe Nord-Sud, puis décale la barre rouge d’1 tenon vers le Sud et de 4 vers l'Ouest. Le côté Est de la barre rouge doit être aligné sur le côté Ouest du dernier cube posé."
            },
            {
                "id": "2",
                "sentence": "Place une barre rouge orientée Est-Ouest au Sud de la croix jaune, en alignant son côté Est avec le côté Ouest du cube précédent. Puis décale-la d’1 tenon vers le Sud."
            },
            {
                "id": "3",
                "sentence": "Place une barre rouge orientée Est-Ouest au Sud de la croix en laissant 1 tenon libre, et en alignant son bord Est avec le bord Ouest du cube précédent."
            },
            {
                "id": "4",
                "sentence": "Place une barre rouge orientée Est-Ouest au Sud de la croix jaune, avec son coin Nord-Est touchant le coin Sud-Ouest du cube précédent. Puis décale-la d'1 tenon vers le Sud."
            },
            {
                "id": "5",
                "sentence": "Place le coin Nord-Est d’une barre rouge Est-Ouest au contact du coin Sud-Ouest du cube précédent. Puis déplace-la d’1 tenon vers le Sud."
            }
        ]
    },
    {
        "scene": 19,
        "sentences": [
            {
                "id": "1",
                "sentence": "Colle une barre rouge au Sud de la croix jaune en la centrant sur l'axe Nord-Sud de la croix, puis décale-la de 3 tenons vers l'Ouest et de 2 vers le Sud. Le côté Ouest de la barre rouge doit être aligné sur l'axe Nord-Sud de la croix."
            },
            {
                "id": "2",
                "sentence": "Aligne avec l'axe Nord-Sud une barre rouge Est-Ouest 2 tenons au Sud de la croix jaune, puis décale-le de 3 tenons vers l'Ouest. La face Est de la barre rouge est alignée avec le centre du cube précédent."
            },
            {
                "id": "3",
                "sentence": "Place une barre rouge orientée Est-Ouest au Sud de la croix en laissant 2 tenons libres, et en alignant son bord Est avec le centre du dernier cube posé."
            },
            {
                "id": "4",
                "sentence": "Place une barre rouge orientée Est-Ouest à 2 tenons au Sud de la croix avec son côté Est coïncidant avec l’axe Nord-Sud de la croix."
            },
            {
                "id": "5",
                "sentence": "Colle une barre rouge au Sud du cube précédent en alignant les bords Est, puis décale-la d’1 tenon vers l'Ouest et de 2 vers le Sud."
            },
            {
                "id": "6",
                "sentence": "Place une barre rouge orientée Est-Ouest 2 tenons au Sud du cube précédent en faisant coïncider son centre avec le bord le plus à l’Ouest de la croix."
            }
        ]
    },
    {
        "scene": 20,
        "sentences": [
            {
                "id": "1",
                "sentence": "Colle une barre bleue orientée Nord-Sud à l'Ouest de la croix jaune en alignant leurs axes Est-Ouest, puis décale la barre de 6 tenons vers l'Ouest et de 2 vers le Sud."
            },
            {
                "id": "2",
                "sentence": "Place une barre bleue orientée Nord-Sud, pour que sa face Est soit à 8 tenons libres à l'Ouest du cube précédent et que les 2 pièces soient centrées sur l’axe Est-Ouest."
            },
            {
                "id": "3",
                "sentence": "Place une barre bleue orientée Nord-Sud à l'Ouest de la croix, en alignant son bord Nord avec le bord Nord de la barre jaune, et en laissant 6 tenons libres entre la barre et la croix."
            },
            {
                "id": "4",
                "sentence": "Place une barre bleue orientée Nord-Sud 6 tenons à l'Ouest de la croix jaune. Son bord Nord doit être aligné avec le bord Nord de la branche Est-Ouest de la croix."
            }
        ]
    },
    {
        "scene": 21,
        "sentences": [
            {
                "id": "1",
                "sentence": "Place un cube bleu à l'Est du cube précédent en laissant 4 tenons libres. Les bords Sud des 2 cubes doivent être alignés."
            },
            {
                "id": "2",
                "sentence": "Bouche le trou Sud-Ouest de la croix jaune avec un cube bleu puis décale-le de 4 tenons vers le Sud."
            },
            {
                "id": "3",
                "sentence": "Place un cube bleu en alignant son côté Ouest sur celui le plus à l'Ouest de la croix jaune et son bord Sud sur celui de la zone rouge."
            },
            {
                "id": "4",
                "sentence": "Place un cube bleu 4 tenons à l'Est de la zone rouge en alignant leurs bords Sud."
            },
            {
                "id": "5",
                "sentence": "Colle un cube bleu dans le prolongement de la branche Sud de la croix jaune, puis décale-le de 2 tenons vers l’Ouest et de 2 tenons vers le Sud."
            },
            {
                "id": "6",
                "sentence": "Colle un cube entre les branches Sud et Ouest de la croix jaune puis décale-le de 4 tenons vers le Sud."
            }
        ]
    },
    {
        "scene": 22,
        "sentences": [
            {
                "id": "1",
                "sentence": "Place un cube bleu au Sud du cube précédent en laissant 4 tenons libres. Son bord Sud doit être aligné sur celui de la zone rouge."
            },
            {
                "id": "2",
                "sentence": "Place un cube bleu à l’Est de la zone rouge en laissant 4 tenons libres. Son bord Sud doit être aligné sur celui de la zone et son bord Ouest sur celui du cube précédent."
            },
            {
                "id": "3",
                "sentence": "Place un cube bleu 2 tenons libres au Sud de la croix jaune et 4 tenons libres à l’Est de la zone rouge. Son bord Ouest doit être aligné sur celui du cube précédent."
            },
            {
                "id": "4",
                "sentence": "Colle un cube entre les branches Sud et Ouest de la croix jaune puis décale-le de 4 tenons vers le Sud."
            },
            {
                "id": "5",
                "sentence": "Place un cube bleu en alignant son bord Sud sur celui de la zone rouge et son côté Ouest sur celui le plus à l'Ouest de la croix jaune."
            }
        ]
    },
    {
        "scene": 23,
        "sentences": [
            {
                "id": "1",
                "sentence": "Place un cube bleu au Sud de la barre précédente en laissant 6 tenons libres. Son bord Nord doit être aligné sur le bord Sud de la zone rouge."
            },
            {
                "id": "2",
                "sentence": "Place un cube bleu avec son bord Nord aligné sur celui du Sud de la zone et son bord Ouest sur celui de la barre jaune précédente."
            },
            {
                "id": "3",
                "sentence": "Place un cube bleu à l’Est de la zone rouge en laissant 4 tenons libres et en alignant son bord Nord sur le bord Sud de la zone."
            },
            {
                "id": "4",
                "sentence": "Colle un cube bleu sous la partie sud de la croix, puis déplace le de 4 tenons au Sud et 2 tenons à l’Est."
            },
            {
                "id": "5",
                "sentence": "Colle un cube bleu au contact des branches Est et Sud de la croix, puis déplace le de 6 tenons vers le sud."
            }
        ]
    },
    {
        "scene": 24,
        "sentences": [
            {
                "id": "1",
                "sentence": "Place une barre bleue orientée Nord-Sud à 6 tenons libres à l’Est de la zone rouge. Son bord Sud doit être aligné sur le bord Nord du cube rouge précédemment placé."
            },
            {
                "id": "2",
                "sentence": "Place une barre bleue orientée Nord-Sud à 3 tenons libres de l’extrémité l’Ouest de la croix jaune. Son bord Nord doit être aligné sur le bord Nord de la croix."
            },
            {
                "id": "3",
                "sentence": "Place une barre bleue orientée Nord-Sud à 6 tenons libres à l’Est de la zone rouge. Son bord Sud doit être aligné sur le bord Sud de la croix."
            },
            {
                "id": "4",
                "sentence": "Perpendiculairement à la direction Est de la croix, place une barre bleue centrée en laissant 3 tenons libres."
            },
            {
                "id": "5",
                "sentence": "En laissant 3 tenons libres à l’extrémité Est de la croix, centre une barre bleue orientée Nord-Sud sur l’axe Est-Ouest de la croix."
            }
        ]
    }
]